pandas
----------
- pandas is a builtin library which is used for data analysis . pandas are used for manipulation visualisation building machine learning modles etc 
- pandas impelment a no of powerful data operation familiar to users both database frameworks  and spread sheets programs.
- there ara two main data structures in pandas - series, Dataframes.

In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\saisayyapureddy\anaconda3\lib\site-packages (1.2.4)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\saisayyapureddy\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: pytz>=2017.3 in c:\users\saisayyapureddy\anaconda3\lib\site-packages (from pandas) (2021.1)
Requirement already satisfied: numpy>=1.16.5 in c:\users\saisayyapureddy\anaconda3\lib\site-packages (from pandas) (1.20.1)
Requirement already satisfied: six>=1.5 in c:\users\saisayyapureddy\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)
Note: you may need to restart the kernel to use updated packages.

In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\saisayyapureddy\anaconda3\lib\site-packages (1.2.4)Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: numpy>=1.16.5 in c:\users\saisayyapureddy\anaconda3\lib\site-packages (from pandas) (1.20.1)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\saisayyapureddy\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: pytz>=2017.3 in c:\users\saisayyapureddy\anaconda3\lib\site-packages (from pandas) (2021.1)
Requirement already satisfied: six>=1.5 in c:\users\saisayyapureddy\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

In [4]:
import pandas as pd

In [5]:
pd.__version__

'1.2.4'

### series
- a series id nothing but one dimensional  numpy array ,and conatins  values of the same type(integers, string data time ,etc)
### Data frames 
- a Data frame is simply a table where each  column is a pandas series:
- lists
- tuple
- Dictionary
- Numpy
- Date_Range

In [6]:
k = [1,2,34,78,90,54,82]
p1 = pd.Series(k)
p1

0     1
1     2
2    34
3    78
4    90
5    54
6    82
dtype: int64

In [20]:
t = (12,13,14,56,78,89,123)
p2 = pd.Series(t)
p2

0     12
1     13
2     14
3     56
4     78
5     89
6    123
dtype: int64

In [17]:
d = {"A":67,"B":89,"C":"de"}
p3 = pd.Series(d)
p3

A    67
B    89
C    de
dtype: object

In [18]:
p2.index = ["ab",9,"34",61,21]

ValueError: Length mismatch: Expected axis has 7 elements, new values have 5 elements

In [19]:
P2

NameError: name 'P2' is not defined

In [21]:
p2

0     12
1     13
2     14
3     56
4     78
5     89
6    123
dtype: int64

In [22]:
p1[1:6]

1     2
2    34
3    78
4    90
5    54
dtype: int64

In [28]:
p1[:6:2]

0     1
2    34
4    90
dtype: int64

In [29]:
import numpy as np

In [33]:
p1.index = np.arange(30,37)
p1

30     1
31     2
32    34
33    78
34    90
35    54
36    82
dtype: int64

In [35]:
p4 = pd.Series("python",index=[1,34,57,69])
p4

1     python
34    python
57    python
69    python
dtype: object

In [39]:
s = pd.Series([x**2 for x in range(11)])
s

0       0
1       1
2       4
3       9
4      16
5      25
6      36
7      49
8      64
9      81
10    100
dtype: int64

In [48]:
s1 = pd.Series(np.square(np.arange(100)))
s1

0        0
1        1
2        4
3        9
4       16
      ...
95    9025
96    9216
97    9409
98    9604
99    9801
Length: 100, dtype: int32

In [49]:
dates = pd.date_range(start= "2021-10-5",end = "2021-10-12")
dates

DatetimeIndex(['2021-10-05', '2021-10-06', '2021-10-07', '2021-10-08',
               '2021-10-09', '2021-10-10', '2021-10-11', '2021-10-12'],
              dtype='datetime64[ns]', freq='D')

In [51]:
help(pd.date_range)

Help on function date_range in module pandas.core.indexes.datetimes:

date_range(start=None, end=None, periods=None, freq=None, tz=None, normalize=False, name=None, closed=None, **kwargs) -> pandas.core.indexes.datetimes.DatetimeIndex
    Return a fixed frequency DatetimeIndex.

    Parameters
    ----------
    start : str or datetime-like, optional
        Left bound for generating dates.
    end : str or datetime-like, optional
        Right bound for generating dates.
    periods : int, optional
        Number of periods to generate.
    freq : str or DateOffset, default 'D'
        Frequency strings can have multiples, e.g. '5H'. See
        :ref:`here <timeseries.offset_aliases>` for a list of
        frequency aliases.
    tz : str or tzinfo, optional
        Time zone name for returning localized DatetimeIndex, for example
        'Asia/Hong_Kong'. By default, the resulting DatetimeIndex is
        timezone-naive.
    normalize : bool, default False
        Normalize start/end dates to midnight before generating date range.
    name : str, default None
        Name of the resulting DatetimeIndex.
    closed : {None, 'left', 'right'}, optional
        Make the interval closed with respect to the given frequency to
        the 'left', 'right', or both sides (None, the default).
    **kwargs
        For compatibility. Has no effect on the result.

    Returns
    -------
    rng : DatetimeIndex

    See Also
    --------
    DatetimeIndex : An immutable container for datetimes.
    timedelta_range : Return a fixed frequency TimedeltaIndex.
    period_range : Return a fixed frequency PeriodIndex.
    interval_range : Return a fixed frequency IntervalIndex.

    Notes
    -----
    Of the four parameters ``start``, ``end``, ``periods``, and ``freq``,
    exactly three must be specified. If ``freq`` is omitted, the resulting
    ``DatetimeIndex`` will have ``periods`` linearly spaced elements between
    ``start`` and ``end`` (closed on both sides).

    To learn more about the frequency strings, please see `this link
    <https://pandas.pydata.org/pandas-docs/stable/user_guide/timeseries.html#offset-aliases>`__.

    Examples
    --------
    **Specifying the values**

    The next four examples generate the same `DatetimeIndex`, but vary
    the combination of `start`, `end` and `periods`.

    Specify `start` and `end`, with the default daily frequency.

    >>> pd.date_range(start='1/1/2018', end='1/08/2018')
    DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
                   '2018-01-05', '2018-01-06', '2018-01-07', '2018-01-08'],
                  dtype='datetime64[ns]', freq='D')

    Specify `start` and `periods`, the number of periods (days).

    >>> pd.date_range(start='1/1/2018', periods=8)
    DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
                   '2018-01-05', '2018-01-06', '2018-01-07', '2018-01-08'],
                  dtype='datetime64[ns]', freq='D')

    Specify `end` and `periods`, the number of periods (days).

    >>> pd.date_range(end='1/1/2018', periods=8)
    DatetimeIndex(['2017-12-25', '2017-12-26', '2017-12-27', '2017-12-28',
                   '2017-12-29', '2017-12-30', '2017-12-31', '2018-01-01'],
                  dtype='datetime64[ns]', freq='D')

    Specify `start`, `end`, and `periods`; the frequency is generated
    automatically (linearly spaced).

    >>> pd.date_range(start='2018-04-24', end='2018-04-27', periods=3)
    DatetimeIndex(['2018-04-24 00:00:00', '2018-04-25 12:00:00',
                   '2018-04-27 00:00:00'],
                  dtype='datetime64[ns]', freq=None)

    **Other Parameters**

    Changed the `freq` (frequency) to ``'M'`` (month end frequency).

    >>> pd.date_range(start='1/1/2018', periods=5, freq='M')
    DatetimeIndex(['2018-01-31', '2018-02-28', '2018-03-31', '2018-04-30',
                   '2018-05-31'],
                  dtype='datetime64[ns]', freq='M')

    Multiples are allowed

    >>> pd.date_range(start='1/1/2018', periods=5, freq='3M')
    DatetimeIndex(['2018-01-31', '2018-04-30', '2018-07-31', '2018-10-31',
                   '2019-01-31'],
                  dtype='datetime64[ns]', freq='3M')

    `freq` can also be specified as an Offset object.

    >>> pd.date_range(start='1/1/2018', periods=5, freq=pd.offsets.MonthEnd(3))
    DatetimeIndex(['2018-01-31', '2018-04-30', '2018-07-31', '2018-10-31',
                   '2019-01-31'],
                  dtype='datetime64[ns]', freq='3M')

    Specify `tz` to set the timezone.

    >>> pd.date_range(start='1/1/2018', periods=5, tz='Asia/Tokyo')
    DatetimeIndex(['2018-01-01 00:00:00+09:00', '2018-01-02 00:00:00+09:00',
                   '2018-01-03 00:00:00+09:00', '2018-01-04 00:00:00+09:00',
                   '2018-01-05 00:00:00+09:00'],
                  dtype='datetime64[ns, Asia/Tokyo]', freq='D')

    `closed` controls whether to include `start` and `end` that are on the
    boundary. The default includes boundary points on either end.

    >>> pd.date_range(start='2017-01-01', end='2017-01-04', closed=None)
    DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03', '2017-01-04'],
                  dtype='datetime64[ns]', freq='D')

    Use ``closed='left'`` to exclude `end` if it falls on the boundary.

    >>> pd.date_range(start='2017-01-01', end='2017-01-04', closed='left')
    DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03'],
                  dtype='datetime64[ns]', freq='D')

    Use ``closed='right'`` to exclude `start` if it falls on the boundary.

    >>> pd.date_range(start='2017-01-01', end='2017-01-04', closed='right')
    DatetimeIndex(['2017-01-02', '2017-01-03', '2017-01-04'],
                  dtype='datetime64[ns]', freq='D')

In [55]:
d2 = pd.date_range(start = "2021-06-03",periods=6,freq = '2M')
d2

DatetimeIndex(['2021-06-30', '2021-08-31', '2021-10-31', '2021-12-31',
               '2022-02-28', '2022-04-30'],
              dtype='datetime64[ns]', freq='2M')

In [56]:
p2

0     12
1     13
2     14
3     56
4     78
5     89
6    123
dtype: int64

In [58]:
n = np.arange(10)
p6 = pd.Series(n,index=np.arange(20,30))
p6

20    0
21    1
22    2
23    3
24    4
25    5
26    6
27    7
28    8
29    9
dtype: int32

In [60]:
p6[:4]

20    0
21    1
22    2
23    3
dtype: int32

In [64]:
p6[1:7]

21    1
22    2
23    3
24    4
25    5
26    6
dtype: int32

In [62]:
p6[[20,24,26,29]]

20    0
24    4
26    6
29    9
dtype: int32

In [65]:
p6[::3]

20    0
23    3
26    6
29    9
dtype: int32

In [66]:
p6

20    0
21    1
22    2
23    3
24    4
25    5
26    6
27    7
28    8
29    9
dtype: int32

In [67]:
p6[::4]

20    0
24    4
28    8
dtype: int32

In [68]:
li = [13,24,35,47,68,59]
d1 = pd.DataFrame(li)
d1

    0
0  13
1  24
2  35
3  47
4  68
5  59

In [70]:
li = range(20,30)
d1 = pd.DataFrame(li)
d1

    0
0  20
1  21
2  22
3  23
4  24
5  25
6  26
7  27
8  28
9  29

In [72]:
li1 = [[1,2,3],[4,5,6,],[7,8,9]]
d2 = pd.DataFrame(li1)
d2

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [73]:
d2.index = [12,35,90]
d2

    0  1  2
12  1  2  3
35  4  5  6
90  7  8  9

In [76]:
d2.columns = ["x","y","z"]
d2

    x  y  z
12  1  2  3
35  4  5  6
90  7  8  9

In [78]:
sd = pd.Series([12,67,27,20],index = ["a","b","c","d"])
d3 = pd.DataFrame(sd)
d3

    0
a  12
b  67
c  27
d  20

In [81]:
sd = pd.Series([12,67,27,20],index = ["a","b","c","d"])
d3 = pd.DataFrame(sd,columns = np.arange(1,2))
d3

    1
a  12
b  67
c  27
d  20

In [82]:
empd = pd.DataFrame({"emp":pd.Series(["a","b","c","d"],index = [1,2,3,4]),"dept":pd.Series(["ac","hr","tm","ntm"],index = [1,2,3,4])})
empd

  emp dept
1   a   ac
2   b   hr
3   c   tm
4   d  ntm

In [87]:
empd2 = pd.DataFrame({"emp":pd.Series(["a","b","c","d"],index = [1,2,3,4]),
                     "year":pd.Series([2000,2001,2002,2003],index=[1,2,3,4])})
empd2

  emp  year
1   a  2000
2   b  2001
3   c  2002
4   d  2003

In [90]:
pd.merge(empd,empd2)
pd

In [91]:
empd = pd.DataFrame({"emp":pd.Series(["a","b","c","d"],index = [1,2,3,4]),"dept":pd.Series(["ac","hr","tm","ntm"],index = [1,2,3,4])})
empd


empd2 = pd.DataFrame({"emp":pd.Series(["a","b","c","de"],index = [1,2,3,4]),
                     "year":pd.Series([2000,2001,2002,2003],index=[1,2,3,4])})
pd.merge(empd,empd2)

  emp dept  year
0   a   ac  2000
1   b   hr  2001
2   c   tm  2002

In [92]:
empd = pd.DataFrame({"emp":pd.Series(["a","b","c","d"],index = [1,2,3,4]),"dept":pd.Series(["ac","hr","tm","ntm"],index = [1,2,3,4])})
empd


empd2 = pd.DataFrame({"emp":pd.Series(["a","b","c","de"],index = [1,2,3,4]),
                     "year":pd.Series([2000,2001,2002,2003],index=[1,2,3,4])})
pd.merge(empd,empd2,how = "left")

  emp dept    year
0   a   ac  2000.0
1   b   hr  2001.0
2   c   tm  2002.0
3   d  ntm     NaN

In [93]:
pd.merge(empd,empd2,how = "right")

  emp dept  year
0   a   ac  2000
1   b   hr  2001
2   c   tm  2002
3  de  NaN  2003

In [95]:
empd = pd.DataFrame({"emp":pd.Series(["a","b","c","d"],index = [10,2,3,4]),"dept":pd.Series(["ac","hr","tm","ntm"],index = [1,2,3,4])})
empd


empd2 = pd.DataFrame({"emp":pd.Series(["a","b","c","de"],index = [1,2,3,4]),
                     "year":pd.Series([2000,2001,2002,2003],index=[1,2,3,4])})
pd.merge(empd,empd2,how = "outer")

   emp dept    year
0  NaN   ac     NaN
1    b   hr  2001.0
2    c   tm  2002.0
3    d  ntm     NaN
4    a  NaN  2000.0
5   de  NaN  2003.0

In [97]:
empd2.append(empd)

    emp    year dept
1     a  2000.0  NaN
2     b  2001.0  NaN
3     c  2002.0  NaN
4    de  2003.0  NaN
1   NaN     NaN   ac
2     b     NaN   hr
3     c     NaN   tm
4     d     NaN  ntm
10    a     NaN  NaN

In [103]:
pd.concat([empd,empd2],axis = 1)

    emp dept  emp    year
1   NaN   ac    a  2000.0
2     b   hr    b  2001.0
3     c   tm    c  2002.0
4     d  ntm   de  2003.0
10    a  NaN  NaN     NaN

In [104]:
pd.concat([empd,empd2],axis = 0)

    emp dept    year
1   NaN   ac     NaN
2     b   hr     NaN
3     c   tm     NaN
4     d  ntm     NaN
10    a  NaN     NaN
1     a  NaN  2000.0
2     b  NaN  2001.0
3     c  NaN  2002.0
4    de  NaN  2003.0